__Problem 43__
----
Given the table below, called 'orders', write code to show the average revenue by month by channel:

In [53]:
import pandas as pd
raw_data = {'order_id': [1,2,3,4,5,6],
            'channel': ['Online', 'Online', 'In_store', 'In_store','Online','Online'],
            'date': ['2018-09-01', '2018-09-03', '2018-10-11', "2018-08-21","2018-08-13",'2018-10-29'],
            'month': ['09', '09', '10', '08','08','10'],
            'revenue': [100,125,200,80,200,100]}
df = pd.DataFrame(raw_data, columns = ['order_id', 'channel', 'date','month', 'revenue'])
df

   order_id   channel        date month  revenue
0         1    Online  2018-09-01    09      100
1         2    Online  2018-09-03    09      125
2         3  In_store  2018-10-11    10      200
3         4  In_store  2018-08-21    08       80
4         5    Online  2018-08-13    08      200
5         6    Online  2018-10-29    10      100

Your result should return the following in a structured table:

<pre>Month | Channel | Avg. Revenue</pre>

_____
Solution

In [2]:
df_new = df.groupby(['month', 'channel'])['revenue'].mean().reset_index()
df_new.rename(columns={'revenue':'avg_revenue'})

  month   channel  avg_revenue
0    08  In_store         80.0
1    08    Online        200.0
2    09    Online        112.5
3    10  In_store        200.0
4    10    Online        100.0

Problem 44 
-----
Suppose you work for a retail company that has a database containing two tables, one called 'orders', and one called 'revenue', as shown below:

In [20]:
import sqlite3
conn = sqlite3.connect(':memory:')
crsr = conn.cursor()

def create_table_sql() -> str:
    return """
    CREATE TABLE Orders (
    order_id INTEGER,
    channel VARCHAR(1024),
    date VARCHAR(1024),
    month VARCHAR(1024)
    );
    
    CREATE TABLE Revenue (
        order_id INTEGER,
        revenue INTEGER
    );
    """

crsr.executescript(create_table_sql())
conn.commit()

In [21]:
def insert_data_sql() -> str:
    return """
    INSERT or IGNORE INTO Orders
    (order_id, channel, date, month)
    VALUES
    (1, "Online", "2018-09-01", "September"),
    (2, "Online", "2018-09-03", "September"),
    (3, "In_store", "2018-10-11", "October"),
    (4, "In_store", "2018-08-21", "August"),
    (5, "Online", "2018-08-13", "August"),
    (6, "Online", "2018-10-29", "October");
    
    INSERT or IGNORE INTO Revenue
    (order_id, revenue)
    VALUES
    (1, 100),
    (2, 125),
    (3, 200),
    (4, 80),
    (5, 200),
    (6, 100);
    """

crsr.executescript(insert_data_sql())
conn.commit()

In [50]:
def grab_order_table() -> str:
    return """
    SELECT *
    FROM Orders;
    """

crsr.execute(grab_order_table())
orders = crsr.fetchall()

pd.DataFrame(orders, columns=['order_id', 
                              'channel', 
                              'date', 
                              'month'])

   order_id   channel        date      month
0         1    Online  2018-09-01  September
1         2    Online  2018-09-03  September
2         3  In_store  2018-10-11    October
3         4  In_store  2018-08-21     August
4         5    Online  2018-08-13     August
5         6    Online  2018-10-29    October

In [51]:
def grab_revenue_table() -> str:
    return """
    SELECT *
    FROM Revenue;
    """

crsr.execute(grab_revenue_table())
revenue = crsr.fetchall()

pd.DataFrame(revenue, columns=['order_id', 'revenue'])

   order_id  revenue
0         1      100
1         2      125
2         3      200
3         4       80
4         5      200
5         6      100

In [53]:
import pandas as pd
raw_data = {'order_id': [1,2,3,4,5,6],
            'channel': ['Online', 'Online', 'In_store', 'In_store','Online','Online'],
            'date': ['2018-09-01', '2018-09-03', '2018-10-11', "2018-08-21","2018-08-13",'2018-10-29'],
            'month': ['09', '09', '10', '08','08','10'],
            'revenue': [100,125,200,80,200,100]}
df = pd.DataFrame(raw_data, columns = ['order_id', 'channel', 'date','month', 'revenue'])
df

   order_id   channel        date month  revenue
0         1    Online  2018-09-01    09      100
1         2    Online  2018-09-03    09      125
2         3  In_store  2018-10-11    10      200
3         4  In_store  2018-08-21    08       80
4         5    Online  2018-08-13    08      200
5         6    Online  2018-10-29    10      100

Your result should return the following in a structured table:

<pre>Month | Channel | Avg. Revenue</pre>

_____
Solution

In [2]:
df_new = df.groupby(['month', 'channel'])['revenue'].mean().reset_index()
df_new.rename(columns={'revenue':'avg_revenue'})

  month   channel  avg_revenue
0    08  In_store         80.0
1    08    Online        200.0
2    09    Online        112.5
3    10  In_store        200.0
4    10    Online        100.0

In [52]:
def get_sql() -> str:
    return """
    SELECT o.channel,
           SUM(r.revenue) AS total_revenue
    FROM Orders o
    JOIN Revenue r
    ON o.order_id = r.order_id
    WHERE o.month IN ("September", "October")
    GROUP BY o.channel
    """
crsr.execute(get_sql2())
result = crsr.fetchall()
pd.DataFrame(result, columns=['channel', 'total_revenue'])

    channel  total_revenue
0  In_store            200
1    Online            325

Problem 42
-----

You are given an array containing reviews for a popular iOS app below:

reviews = [‘app is good, but forced updates are too frequent‘, ‘love this app, use it daily to log calories', 'free version of this app has way too many ads’, ‘app doesn't load, 0/10’]

Your task is to determine sentiment from the review above. To do this you first decide to write code to find the count of individual words across all the reviews -- write this code using Python.

In [1]:
def word_dist(reviews):
    word_count = {}
    
    for review in reviews:
        words = review.split(' ')
        for word in words:
            if word not in word_count:
                word_count[word] = 1
            else:
                word_count[word] += 1
    return word_count

In [2]:
reviews = ['app is good, but forced updates are too frequent', 
           'love this app, use it daily to log calories', 
           'free version of this app has way too many ads', 
           "app doesn't load, 0/10"]

word_dist(reviews)

{'app': 3,
 'is': 1,
 'good,': 1,
 'but': 1,
 'forced': 1,
 'updates': 1,
 'are': 1,
 'too': 2,
 'frequent': 1,
 'love': 1,
 'this': 2,
 'app,': 1,
 'use': 1,
 'it': 1,
 'daily': 1,
 'to': 1,
 'log': 1,
 'calories': 1,
 'free': 1,
 'version': 1,
 'of': 1,
 'has': 1,
 'way': 1,
 'many': 1,
 'ads': 1,
 "doesn't": 1,
 'load,': 1,
 '0/10': 1}

Problem 40
----
Given the table below, called 'orders', write a SQL query to show the monthly revenue growth. To calculate the monthly revenue growth, you can apply the following logic:

revenue growth = (current month's revenue-prior month's revenue)/prior month's revenue.

In [48]:
import sqlite3
conn = sqlite3.connect(':memory:')
crsr = conn.cursor()

def create_table_sql() -> str:
    return """
    CREATE TABLE Orders (
    order_id INTEGER,
    channel VARCHAR(1024),
    date VARCHAR(1024),
    month INTEGER,
    revenue FLOAT
    );
    """

crsr.executescript(create_table_sql())
conn.commit()

In [49]:
def insert_data_sql() -> str:
    return """
    INSERT or IGNORE INTO Orders
    (order_id, channel, date, month, revenue)
    VALUES
    (1, "Online", "2018-09-01", 9, 100),
    (2, "Online", "2018-09-03", 9, 125),
    (3, "In_store", "2018-10-11", 10, 200),
    (4, "In_store", "2018-08-21", 8, 80),
    (5, "Online", "2018-08-13", 8, 200);
    """

crsr.executescript(insert_data_sql())
conn.commit()

In [55]:
def get_sql() -> str:
    return """
    SELECT s.month,
           (s.current_rev-s.prior_rev)/s.prior_rev
    FROM (
        SELECT month,
               SUM(revenue) AS current_rev,
               LAG(SUM(revenue),1) OVER (ORDER BY month) AS prior_rev
        FROM Orders
        GROUP BY month
        ORDER BY month
    ) s
    """
crsr.execute(get_sql())
result = crsr.fetchall()
pd.DataFrame(result, columns=['month', 'grow_rate'])

   month  grow_rate
0      8        NaN
1      9  -0.196429
2     10  -0.111111

Problem 39
----
You are given a dataframe containing student information, named df (shown below).
Suppose you want to normalize each student's grade based on their age.

In [56]:
import pandas as pd

raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
                'age': [20, 19, 22, 21],
                'favorite_color': ['blue', 'blue', 'yellow', "green"],
                'grade': [88, 92, 95, 70]}

df = pd.DataFrame(raw_data)
df.head()

               name  age favorite_color  grade
0    Willard Morris   20           blue     88
1       Al Jennings   19           blue     92
2      Omar Mullins   22         yellow     95
3  Spencer McDaniel   21          green     70

Write a function using Python Pandas that will add a new column to your dataframe containing a new grade normalized against the mean age of the students.

In [59]:
df['grade_norm'] = df['grade']*(df['age']/df['age'].mean())

In [60]:
df

               name  age favorite_color  grade  grade_norm
0    Willard Morris   20           blue     88   85.853659
1       Al Jennings   19           blue     92   85.268293
2      Omar Mullins   22         yellow     95  101.951220
3  Spencer McDaniel   21          green     70   71.707317

Problem 38
---------
Suppose an individual is taxed 30% if earnings for a given week are >= \\$2,000. 
If earnings land < \\$2,000 for the week, the individual is taxed at a lower rate of 15%.

Write a function using Python to calculate both the pre-tax and post-tax earnings for a given individual, with the ability to feed in the hourly wage and the weekly hours as inputs.

For example, if an individual earns $55/hour and works for 40 hours, the function should return:

Pre-tax earnings were 55 * 40 = \\$2,200 for the week.
Post-tax earnings were \\$2,200*.7 (since we fall in higher tax bracket here) = \\$1,540 for the week

In [61]:
def income_tax(rate, hrs):
    pre_tax = rate*hrs
    post_tax = pre_tax*(1-0.15)
    
    if pre_tax >= 2000:
        post_tax = pre_tax*(1-0.3)
    
    return pre_tax, post_tax

In [62]:
income_tax(55, 40)

(2200, 1540.0)

Problem 37
----

Suppose you're trying to understand how many managers you have per employee at Company XYZ. On your search to understand, you are given two tables: (1) managers and (2) employees. Each table has 1 column named id.

Given this dataset, can you use SQL to find the employees that are also managers? Hint: given the table names as well as the single column name you should be able to write a full SQL query.

In [1]:
import sqlite3
conn = sqlite3.connect(':memory:')
crsr = conn.cursor()

def create_table_sql() -> str:
    return """
    CREATE TABLE managers (
        id INTEGER
    );
    
    CREATE TABLE employees (
        id INTEGER
    );
    """

crsr.executescript(create_table_sql())
conn.commit()

In [2]:
def insert_data_sql() -> str:
    return """
    INSERT or IGNORE INTO managers
    (id)
    VALUES
    (1),
    (2),
    (3),
    (4),
    (5),
    (6);
    
    INSERT or IGNORE INTO employees
    (id)
    VALUES
    (1),
    (2),
    (3),
    (4),
    (5),
    (6),
    (40),
    (23),
    (21),
    (400);
    """

crsr.executescript(insert_data_sql())
conn.commit()

In [3]:
def get_sql() -> str:
    return """
    SELECT e.*
    FROM employees e
    JOIN managers m
    ON e.id = m.id
    """

crsr.execute(get_sql())
result = crsr.fetchall()

In [4]:
result

[(1,), (2,), (3,), (4,), (5,), (6,)]

Problem 36
--- 
Suppose you are playing a game with a fair die (e.g. no bias for any one side), and your expected payout based on the # you roll is shown the table below. If you have to pay $1 to play, is it worth the cost to play?


|Roll |	Payout|
|-----|-------|
6	|\\$4
5	|\\$2
4	|\\$1
3	|\\$0
2	|\\$0
1	| \\$0

In [13]:
import numpy as np
outcomes = np.repeat(1/6,6)
payouts = np.array([0,0,0,1,2,4])
EX = np.sum(outcomes*payouts) - 1
print(f'expected return is {EX}, so yeah, it\'s still worth to play')

expected return is 0.16666666666666652, so yeah, it's still worth to play

Problem 35
--- 
Suppose you have a dataframe, df, with the following records:

In [14]:
import pandas as pd

raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
                'age': [20, 19, 22, 21],
                'favorite_color': ['blue', 'blue', 'yellow', "green"],
                'grade': [88, 92, 95, 70]}

df = pd.DataFrame(raw_data)
df.head()

               name  age favorite_color  grade
0    Willard Morris   20           blue     88
1       Al Jennings   19           blue     92
2      Omar Mullins   22         yellow     95
3  Spencer McDaniel   21          green     70

The dataframe is showing information about students. Write code using Python Pandas to select the rows where the students' favorite color is blue or yellow and their grade is above 90.

In [15]:
df.query("favorite_color in ['blue', 'yellow'] and grade > 90")

           name  age favorite_color  grade
1   Al Jennings   19           blue     92
2  Omar Mullins   22         yellow     95

Problem 34
---
A prime number (or a prime) is a natural number greater than 1 that cannot be formed by multiplying two smaller natural numbers. Given a single #, n, write a function using Python to return whether or not the # is prime. Additionally, if the inputted # is prime, save it into an array, a.

In [39]:
def is_prime(num, a):
    if num < 2:
        return False
    else:
        for i in range(2,num):
            if num%i == 0:
                return False

        a.append(num)
        return True

In [40]:
a = []
is_prime(234293423,a)

False

In [41]:
a

[]

In [42]:
is_prime(2,a)

True

In [43]:
a

[2]

Problem 33
----
Suppose you're consulting for a school district, and the head of the school district thinks the students have above average intelligence. A random sample of thirty students have a mean IQ score of 112. Is there sufficient evidence to support the head's claim?

You can assume the mean IQ score across the population of all students (e.g. including students outside the head's school district) is 100, with a standard deviation of 15.

In [54]:
print(f"""
      hypothesis test:
        null hypothesis H0: mu=0
        alternative hypothesis H1: mu>0
      Assume the alpha is 0.05, corresponding to a z-score of 1.645 (one tail)
      the z score for our sample is (x-mu)/(std/sqrt(N)) = {np.round((112-100)/(15/np.sqrt(30)),3)}
      which is significantly greater than 1.645. 
      Therefore, we can reject the null hypothesis, meaning there's enough evidence to support
      the head's claim
      """)

      hypothesis test:
        null hypothesis H0: mu=0
        alternative hypothesis H1: mu>0
      Assume the alpha is 0.05, corresponding to a z-score of 1.645 (one tail)
      the z score for our sample is (x-mu)/(std/sqrt(N)) = 4.382
      which is significantly greater than 1.645.
      Therefore, we can reject the null hypothesis, meaning there's enough evidence to support
      the head's claim

Problem 32
----

You're analyzing revenue for Company XYZ and want to understand what the revenue per employee was in 2017.

Can you write a query to calculate revenue per employee by product area? Answer will be written in SQL for premium users.

In [16]:
import sqlite3
conn = sqlite3.connect(':memory:')
crsr = conn.cursor()

def create_table_sql() -> str:
    return """
    CREATE TABLE employees (
    employeeid INTEGER,
    product_area VARCHAR(1024),
    compensation INTEGER
    );
    
    CREATE TABLE revenue (
        date VARCHAR(1024),
        product_area VARCHAR(1024),
        revenue INTEGER
    );
    """

crsr.executescript(create_table_sql())
conn.commit()

In [17]:
def insert_data_sql() -> str:
    return """
    INSERT or IGNORE INTO employees
    (employeeid, product_area, compensation)
    VALUES
    (1, "Online", 100),
    (2, "Online", 200),
    (3, "In_store", 100),
    (4, "In_store", 100),
    (5, "Online", 100),
    (6, "Online", 100);
    
    INSERT or IGNORE INTO revenue
    (date, product_area, revenue)
    VALUES
    ("2018-01-09", "Online", 40),
    ("2017-03-04", "In_store", 50),
    ("2017-06-03", "Online", 100),
    ("2018-03-04", "In_store", 150),
    ("2017-05-04", "Online", 200),
    ("2017-09-04", "In_store", 10);
    """

crsr.executescript(insert_data_sql())
conn.commit()

In [18]:
def get_sql() -> str:
    return """
    
    SELECT e.product_area, 
           SUM(r.revenue) / COUNT(e.employeeid) AS revenue_per_employee
    FROM employees e
    JOIN revenue r
    ON e.product_area = r.product_area
    WHERE r.date >= "2017-01-01" AND
          r.date <= "2017-12-31"
    GROUP BY r.product_area
    ORDER BY 2
    """

crsr.execute(get_sql())
revenue = crsr.fetchall()

import pandas as pd
pd.DataFrame(revenue, columns=['product_area', 'revenue_per_employee'])

  product_area  revenue_per_employee
0     In_store                    30
1       Online                   150

Problem 31 
---
Suppose you're analyzing a population of 100,000 people, and you're trying to understand life expectancy. Within this population of 100,000 people, 75% can expect to live to the age of 70, while 45% can expect to live to age 80. Given that a person is 70, what is the probability that they live to the age 80?

By using Bayes' theorem, given the person is 70, the probability that he would live up to 80 would be 
P( living to 80 | living to 70) = P( living to 70 | living to 80) * P(living to 80) / P(living to 70)

We already know that P(living to 80) = 0.45 and P(living to 70) = 0.75, also we know that if a person has already lived up to 80, the probability that he's going to live to 70 is 100%. Thus, we just need to plug in the numbers to get the final result. P( living to 80 | living to 70) = (1.0 * 0.45) / 0.75 = 0.6

Problem 30
--- 
Suppose you are given a dataframe (called df) of students, and you need to assign grades to each student. The table schema is as follows:

In [1]:
#libaries
import pandas as pd

raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
                'age': [20, 19, 22, 21],
                'favorite_color': ['blue', 'blue', 'yellow', "green"],
                'grade': [88, 92, 95, 70]}

df = pd.DataFrame(raw_data)
df.head()

               name  age favorite_color  grade
0    Willard Morris   20           blue     88
1       Al Jennings   19           blue     92
2      Omar Mullins   22         yellow     95
3  Spencer McDaniel   21          green     70

You need to assign the following letter grades based on final_grade_pct in a new column named "final_grade_letter":

- \>90 - A
- 81-90 - B
- 71-80 - C
- <70 - D

Write a function using Python to loop through the table and assign the appropriate letter grades to each student, adding a new column to the existing dataframe, df.

In [2]:
def assign_grade(grade):
    if grade > 90:
        return 'A'
    elif 81 <= grade <= 90:
        return 'B'
    elif 71 <= grade <= 80:
        return 'C'
    else:
        return 'D'

df['final_grade_letter'] = df['grade'].apply(assign_grade)

In [3]:
df

               name  age favorite_color  grade final_grade_letter
0    Willard Morris   20           blue     88                  B
1       Al Jennings   19           blue     92                  A
2      Omar Mullins   22         yellow     95                  A
3  Spencer McDaniel   21          green     70                  D

Problem 29
---
There are a few ways we can score in American Football:

- 1 point - After scoring a touchdown, the team can choose to score a field goal
- 2 points - (1) after scoring touchdown, a team can choose to score a conversion, when the team attempts to score a secondary touchdown or (2) an uncommon way to score, a safety is score when the opposing team causes the ball to become dead
- 3 points - If no touchdown is scored on the possession, a team can attempt to make a field goal
- 6 points - Awarded for a touchdown

Given the above, let's assume the potential point values for American Football are:
- 2 points - safety
- 3 points - only field goal
- 6 points - only touchdown
- 7 points - touchdown + field goal
- 8 points - touchdown + conversion


Given a score value, can you write a function that lists the possible ways the score could have been achieved?
For example, if you're given the score value 10, the potential values are:

- 8 points (touchdown + conversion) + 2 points (safety)
- 6 points (only touchdown) + 2x2 points (safety)
- 7 points (touchdown + field goal) + 3 points (only field goal)
- 5x2 points (safety)
- 2x2 points (safety) + 2x3 points (only field goal)

In [14]:
import numpy as np
def possible_ways(score):
    possible_results = []
    outcomes = np.array([2,3,6,7,8])
    max_iters = np.floor(score/outcomes).astype(int)+1
    
    for x1 in range(max_iters[0]):
        for x2 in range(max_iters[1]):
            for x3 in range(max_iters[2]):
                for x4 in range(max_iters[3]):
                    for x5 in range(max_iters[4]):
                        if 2*x1+3*x2+6*x3+7*x4+8*x5 == score:
                            possible_results.append([x1, x2, x3, x4, x5])
                        
    return possible_results

In [17]:
possible_ways(10)

[[0, 1, 0, 1, 0],
 [1, 0, 0, 0, 1],
 [2, 0, 1, 0, 0],
 [2, 2, 0, 0, 0],
 [5, 0, 0, 0, 0]]

Problem 28
 ---
 
Suppose you're trying to figure out your chances of winning the lottery. The specific lottery you're interested in has 49 balls, each showing a single number. To win the jackpot you need to match 6 balls to win (note that order does not matter).

What is the probability that you can win the jackpot, given you buy 1 ticket?

What if you buy 3 lottery tickets?

In [19]:
### since the order of the ball does not matter 
p_1ball = (6/49)*(6/48)*(6/47)*(6/46)*(6/45)
print(f'probability of winning the jackpot with 1 ticket is {p_1ball}')

probability of winning the jackpot with 1 ticket is 3.398214049727199e-05

In [20]:
### since the three tickets are independent
p_3ball = p_1ball*3
print(f'probability of winning the jackpot with 3 tickets is {p_3ball}')

probability of winning the jackpot with 3 tickets is 0.00010194642149181595

Problem 27
---

Suppose you work for Airbnb as an analyst. A team has come to you asking which cities make the highest revenue for the company in 2017. Can you write a SQL query to answer the question?

You have one table with property location information and another with stay information. The schema each table is shown below:

In [1]:
import sqlite3
conn = sqlite3.connect(':memory:')
crsr = conn.cursor()

def create_table_sql() -> str:
    return """
    CREATE TABLE property_location_info (
    property_id INTEGER,
    country VARCHAR(1024),
    city_name VARCHAR(1024),
    subregion_name VARCHAR(1024),
    address VARCHAR(1024)
    );
    
    CREATE TABLE stays_info (
        guest_id INTEGER,
        property_id INTEGER,
        host_id INTEGER,
        revenue INTEGER,
        date_start VARCHAR(1024),
        date_end VARCHAR(1024),
        stay_length INTEGER,
        airbnb_revenue INTEGER
    );
    """

crsr.executescript(create_table_sql())
conn.commit()

In [2]:
def insert_data_sql() -> str:
    return """
    INSERT or IGNORE INTO property_location_info
    (property_id, country, city_name, subregion_name, address)
    VALUES
    (1, "US", "New York", "New York", "asadasda"),
    (2, "US", "New York", "New York", "ASDASFA"),
    (3, "US", "Seatle", "Washington", "asdasdasd"),
    (4, "US", "San Francisco", "California", "asd"),
    (5, "US", "New York", "New York", "asdasd"),
    (6, "US", "Los Angeles", "California", "asdasf");
    
    INSERT or IGNORE INTO stays_info
    (guest_id, property_id, host_id, revenue, date_start, date_end, stay_length, airbnb_revenue)
    VALUES
    (1, 1, 111, 200, "2017-01-09", "2017-01-12", 4, 150),
    (2, 2, 222, 300, "2018-09-10", "2018-09-12", 3, 200),
    (3, 3, 333, 200, "2017-04-12", "2017-04-15", 4, 160),
    (4, 4, 111, 50, "2019-01-02", "2019-01-06", 5, 30),
    (5, 5, 222, 150, "2017-12-10", "2017-12-13", 4, 120),
    (6, 6, 333, 600, "2018-10-08", "2018-10-11", 4, 450);
    """

crsr.executescript(insert_data_sql())
conn.commit()

In [19]:
def get_sql() -> str:
    return """
        SELECT sub.city_unique,
               MAX(sub.city_revenue) AS max_revenue
        FROM (
            SELECT p.city_name || ", " || p.subregion_name || ", " || p.country as city_unique,
               SUM(s.airbnb_revenue) AS city_revenue
            FROM property_location_info p
            JOIN stays_info s
            ON p.property_id = s.property_id
            WHERE substr(s.date_start, 1, 4) = "2017"
            GROUP BY p.city_name
        ) sub
    """

crsr.execute(get_sql())
results = crsr.fetchall()

In [20]:
results

[('New York, New York, US', 270)]

Problem 26
--- 
Is drawing a red card and drawing an ace independent? You can read more about a standard card deck here. Hint: Drawing an ace (event A) and drawing a red card (event B) are two separate events -- think of a way to prove (using probability theory) that knowing whether event A occurred impacts the probability of event B occuring.

In [21]:
# probability of drawing an ace
P_ace = 4/52
P_red = 1/2
P_red_n_ace = 2/52
assert P_ace*P_red == P_red_n_ace

In [22]:
print(f'P(ace)*P(red) = P(ace and red), therefore, red is independent from ace.')

P(ace)*P(red) = P(ace and red), therefore, red is independent from ace.

Problem 25
--- 
Your team at Apple released a new feature that collects feedback when an app launches. As part of the Alpha Launch for testing, the feedback consists of 1 question within a dialog box that asks "Would you like to give {App Name} your credit card number?", with potential answers being "Yes" and "No".

This data is logged within a table named 'dialogbox_feedback' with the following schema:

In [2]:
#libaries
import pandas as pd
import numpy as np
raw_data = {'time': [10, 20, 10, 30],
            'user_id': [10, 19, 22, 21],
            'app_id': [20, 13, 23, 45],
            'app_name': ['candy', 'uber', 'candy', 'naruto'],
            'event': ['yes', 'yes', 'no', 'yes']}

df = pd.DataFrame(raw_data)
df.head()

   time  user_id  app_id app_name event
0    10       10      20    candy   yes
1    20       19      13     uber   yes
2    10       22      23    candy    no
3    30       21      45   naruto   yes

Question: A Product Manager asked you to give an update on how the Alpha Launch is going. You decide to aggregate (e.g. pivot) the events by each app to provide a quick summary. Write the aggregation using Python (Pandas).

In [7]:
df.pivot_table(df, index=['app_name', 'app_id', 'event'], aggfunc='count')

                       time  user_id
app_name app_id event
candy    20     yes       1        1
         23     no        1        1
naruto   45     yes       1        1
uber     13     yes       1        1